; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v5)
             (pred_10 ?v8 ?v1)
             (pred_6 ?v4 ?v1)
             (pred_7 ?v6 ?v4 )
	     (pred_12 ?v4)
             (pred_5 ?v11)
             (pred_4 ?v8)
             (pred_3 ?v1)
             (pred_9 ?v4)
             (pred_11 ?v8)
             (pred_8 ?v4)
             (pred_2 ))



(:action op_5
:parameters (?v7 ?v10 ?v3 ?v12)
:precondition (and (pred_5 ?v7) (pred_5 ?v10) (pred_4 ?v3) (pred_3 ?v12)
          (pred_1 ?v7 ?v10) (pred_10 ?v3 ?v12)
                   (pred_6 ?v10 ?v12) (pred_12 ?v7) 
                   (pred_9 ?v10) (pred_11 ?v3))
:effect (and  (pred_8 ?v10) (not (pred_9 ?v10))))


(:action op_4
:parameters (?v7 ?v13)
:precondition (and (pred_5 ?v7) (pred_5 ?v13)
               (pred_12 ?v7) (pred_1 ?v7 ?v13) (pred_8 ?v13))
:effect (and (pred_12 ?v13) (not (pred_12 ?v7))))

(:action op_1
:parameters (?v7 ?v3)
:precondition (and (pred_5 ?v7) (pred_4 ?v3) 
                  (pred_12 ?v7) (pred_7 ?v3 ?v7) (pred_2 ))
:effect (and (pred_11 ?v3)
   (not (pred_7 ?v3 ?v7)) (not (pred_2 ))))


(:action op_3
:parameters (?v7 ?v2 ?v9)
:precondition (and (pred_5 ?v7) (pred_4 ?v2) (pred_4 ?v9)
                  (pred_12 ?v7) (pred_11 ?v9) (pred_7 ?v2 ?v7))
:effect (and (pred_11 ?v2) (pred_7 ?v9 ?v7)
        (not (pred_11 ?v9)) (not (pred_7 ?v2 ?v7))))

(:action op_2
:parameters (?v7 ?v3)
:precondition (and (pred_5 ?v7) (pred_4 ?v3) 
                  (pred_12 ?v7) (pred_11 ?v3))
:effect (and (pred_2 ) (pred_7 ?v3 ?v7) (not (pred_11 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_18 obj_13 obj_16 obj_06 obj_14 obj_11 obj_02 obj_20 obj_12 obj_09 obj_05 obj_15 obj_08 obj_17 obj_03 obj_07
    obj_19 obj_10
    obj_01 obj_04
    )

    (:init
       (pred_2)

       (pred_5 obj_18)
       (pred_5 obj_13)
       (pred_5 obj_16)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_08)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_04)

       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_16 obj_02)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_02 obj_05)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_02 obj_16)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_05)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_05 obj_02)
       (pred_1 obj_05 obj_09)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_03)
       (pred_9 obj_14)
       (pred_9 obj_08)
       (pred_6  obj_14 obj_19)
       (pred_6  obj_08 obj_10)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_09)
       (pred_8 obj_05)
       (pred_8 obj_15)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_07)

       (pred_10  obj_01 obj_19)
       (pred_10  obj_04 obj_10)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_04 obj_07)
       (pred_12 obj_05)
    )

    (:goal (and
       (pred_7 obj_01 obj_12)
    ))
(:constraints
  (always (not (pred_12 obj_15)))
)
)

; plan
1. (op_4 obj_05 obj_03)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_07)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_07)
   goals met: 0 of 1
3. (op_1 obj_07 obj_01)
   deleted: (pred_7 obj_01 obj_07) (pred_2)
   added: (pred_11 obj_01)
   goals met: 0 of 1
4. (op_4 obj_07 obj_03)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_03)
   goals met: 0 of 1
5. (op_4 obj_03 obj_05)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_05)
   goals met: 0 of 1
6. (op_4 obj_05 obj_09)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_09)
   goals met: 0 of 1
7. (op_4 obj_09 obj_12)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_12)
   goals met: 0 of 1
8. (op_2 obj_12 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_2) (pred_7 obj_01 obj_12)
   goals met: 1 of 1
